Repository: Dev21Maker/LinguaVisual
Catalog: lib/l10n/app_*.arb
Languages: pl

# commonCancel
source: CANCEL
pl: ANULUJ

# commonCreate
source: CREATE
pl: UTWÓRZ

# commonError
source: Error
pl: Błąd

# commonRetry
source: Retry
pl: Ponów

# flashcardsAddSomeFlashcards
source: Add some flashcards to get started
pl: Dodaj kilka fiszek, aby rozpocząć

# flashcardsAllFlashcardsDropdown
source: All Flashcards
pl: Wszystkie fiszki

# flashcardsAppBarTitle
source: Flashcards
pl: Fiszki

# flashcardsCreateStackDialogTitle
source: Create New Stack
pl: Utwórz nowy stos

# flashcardsCreateStackMenuItem
source: Create Stack
pl: Utwórz stos

# flashcardsErrorLoadingFlashcards
source: Error loading flashcards
pl: Błąd wczytywania fiszek

# flashcardsErrorLoadingStacks
source: Error loading stacks
pl: Błąd wczytywania stosów

# flashcardsGenericError
source: An error occurred while loading flashcards
pl: Wystąpił błąd podczas wczytywania fiszek

# flashcardsLoadingStacks
source: Loading Stacks...
pl: Ładowanie stosów...

# flashcardsMoveButton
source: Move
pl: Przenieś

# flashcardsMoveToStackDialogTitle
source: Move to Stack
pl: Przenieś do stosu

# flashcardsNoFlashcards
source: No flashcards available
pl: Brak dostępnych fiszek

# flashcardsNoStacksAvailable
source: No stacks available. Create a stack first.
pl: Brak stosów. Najpierw utwórz stos.

# flashcardsRemoveFromCurrentStack
source: Remove from current stack
pl: Usuń z bieżącego stosu

# flashcardsReverseOrderTooltip
source: Reverse Order
pl: Odwróć kolejność

# flashcardsStackDescriptionHint
source: Enter stack description
pl: Wprowadź opis stosu

# flashcardsStackDescriptionLabel
source: Description
pl: Opis

# flashcardsStackNameHint
source: Enter stack name
pl: Wprowadź nazwę stosu

# flashcardsStackNameLabel
source: Stack Name
pl: Nazwa stosu

# gamesAppBarTitle
source: Games
pl: Gry

# gamesSrsTrainingTitle
source: SRS Training
pl: Trening SRS

# imagePickerAppBarTitle
source: Image Picker
pl: Wybór obrazu

# imagePickerSelectedSnackbar
source: Image selected! Tap the checkmark to use it.
pl: Obraz wybrany! Stuknij znacznik, aby go użyć.

# imagePickerUseButton
source: Use
pl: Użyj

# learnAllFlashcards
source: All Flashcards
pl: Wszystkie fiszki

# learnAppBarTitle
source: Review Cards
pl: Powtórka

# learnErrorLoadingSession
source: Error loading session
pl: Błąd wczytywania sesji

# learnErrorLoadingStack
source: Error loading stack. Showing all cards.
pl: Błąd wczytywania stosu. Wyświetlam wszystkie karty.

# learnErrorLoadingStacks
source: Error loading stacks
pl: Błąd wczytywania stosów

# learnLoadCardsButton
source: Load Cards
pl: Wczytaj karty

# learnLoadingSession
source: Loading review session...
pl: Ładowanie sesji powtórki...

# learnLoadingStacks
source: Loading Stacks...
pl: Ładowanie stosów...

# learnLoadNextClosestPrompt
source: Load next 10 closest cards?
pl: Wczytać następne 10 najbliższych kart?

# learnNoCardsAvailableSubtitle
source: Either add some flashcards or select a different stack.
pl: Dodaj kilka fiszek lub wybierz inny stos.

# learnNoCardsAvailableTitle
source: No cards available for review.
pl: Brak kart do powtórki.

# learnNoCardsDueNow
source: No cards due right now.
pl: Żadne karty nie są teraz wymagalne.

# learnRatingGood
source: Good
pl: Dobrze

# learnRatingMissed
source: Missed
pl: Pominięte

# learnRatingQuick
source: Quick
pl: Szybko

# learnReviewSummaryTitle
source: Review Summary
pl: Podsumowanie powtórki

# learnSelectStackTitle
source: Select Stack
pl: Wybierz stos

# learnSelectStackTooltip
source: Select Stack
pl: Wybierz stos

# learnSessionCompleteSubtitle
source: You've completed this review session.
pl: Ukończyłeś tę sesję powtórki.

# learnSessionCompleteTitle
source: All cards reviewed!
pl: Wszystkie karty przejrzane!

# learnSummaryGoodLabel
source: Good:
pl: Dobrze:

# learnSummaryMissedLabel
source: Missed:
pl: Pominięte:

# learnSummaryQuickLabel
source: Quick:
pl: Szybko:

# loginAuthError
source: Authentication error
pl: Błąd uwierzytelniania

# loginEmailEmptyValidation
source: Please enter your email
pl: Wprowadź adres e-mail

# loginEmailInvalidValidation
source: Please enter a valid email
pl: Wprowadź poprawny adres e-mail

# loginKeepSignedIn
source: Keep me signed in
pl: Pozostań zalogowany

# loginPasswordEmptyValidation
source: Please enter your password
pl: Wprowadź hasło

# loginPasswordLabel
source: Password
pl: Hasło

# loginSignInButton
source: Sign In
pl: Zaloguj się

# loginSignUpPrompt
source: Don't have an account? Sign Up
pl: Nie masz konta? Zarejestruj się

# loginUnexpectedError
source: An unexpected error occurred
pl: Wystąpił nieoczekiwany błąd

# loginWelcomeBack
source: Welcome Back
pl: Witamy ponownie

# navFlashcards
source: Flashcards
pl: Fiszki

# navLearn
source: Learn
pl: Nauka

# navProgress
source: Progress
pl: Postępy

# navSettings
source: Settings
pl: Ustawienia

# offlineTrainingAppBarTitle
source: Card {current}/{total}
pl: Karta {current}/{total}

# offlineTrainingCompleteButton
source: FINISH
pl: ZAKOŃCZ

# offlineTrainingCompleteContent
source: You reviewed {count} cards
pl: Przejrzano {count} kart

# offlineTrainingCompleteTitle
source: Training Complete!
pl: Trening zakończony!

# offlineTrainingEndSessionButton
source: End Session
pl: Zakończ sesję

# offlineTrainingNoCards
source: No flashcards available
pl: Brak dostępnych fiszek

# progressAppBarTitle
source: Progress
pl: Postępy

# progressErrorLoading
source: Error loading statistics
pl: Błąd wczytywania statystyk

# progressStatDueToday
source: Due Today
pl: Na dzisiaj

# progressStatisticsTitle
source: Statistics
pl: Statystyki

# progressStatLearnedToday
source: Learned Today
pl: Nauczone dzisiaj

# progressStatStreak
source: Streak
pl: Seria

# progressStatTotalCards
source: Total Cards
pl: Łączna liczba kart

# settingsAboutSectionTitle
source: About
pl: O aplikacji

# settingsAccountSectionTitle
source: Account
pl: Konto

# settingsAppSettingsSectionTitle
source: App Settings
pl: Ustawienia aplikacji

# settingsChangeAppLanguageSubtitle
source: Switch the language the app is displayed in
pl: Zmień język wyświetlany w aplikacji

# settingsChangeAppLanguageTitle
source: Change App Language
pl: Zmień język aplikacji

# settingsClearDataButtonPositive
source: YES
pl: TAK

# settingsClearDataDialogContent
source: This will remove all locally stored flashcards and stacks. Continue?
pl: Spowoduje to usunięcie wszystkich lokalnie zapisanych fiszek i stosów. Kontynuować?

# settingsClearDataDialogTitle
source: Clear Offline Data
pl: Wyczyść dane offline

# settingsClearDataSubtitle
source: Free up space
pl: Zwolnij miejsce

# settingsClearDataSuccessSnackbar
source: Offline data cleared successfully.
pl: Dane offline pomyślnie usunięte.

# settingsClearDataTile
source: Clear Offline Data
pl: Wyczyść dane offline

# settingsContactSupportTile
source: Contact Support
pl: Skontaktuj się z pomocą

# settingsDarkModeSubtitle
source: Toggle dark/light theme
pl: Przełącz motyw jasny/ciemny

# settingsDarkModeTile
source: Dark Mode
pl: Tryb ciemny

# settingsLanguageSectionTitle
source: Language Settings
pl: Ustawienia językowe

# settingsLogoutButton
source: LOGOUT
pl: WYLOGUJ

# settingsLogoutCancelButton
source: CANCEL
pl: ANULUJ

# settingsLogoutConfirmButton
source: LOGOUT
pl: WYLOGUJ

# settingsLogoutDialogContent
source: Are you sure you want to logout?
pl: Czy na pewno chcesz się wylogować?

# settingsLogoutDialogTitle
source: Confirm Logout
pl: Potwierdź wylogowanie

# settingsLogoutSubtitle
source: Sign out of your account
pl: Wyloguj się z konta

# settingsLogoutTile
source: Logout
pl: Wyloguj

# settingsLogoutTitle
source: Logout
pl: Wyloguj

# settingsNativeLanguageTile
source: Native Language
pl: Język ojczysty

# settingsPrivacyPolicyTile
source: Privacy Policy
pl: Polityka prywatności

# settingsReviewLimitSubtitle
source: 20 cards
pl: 20 kart

# settingsReviewLimitTile
source: Daily Review Limit
pl: Dzienne ograniczenie powtórek

# settingsReviewRemindersTile
source: Review Reminders
pl: Przypomnienia o powtórkach

# settingsReviewRemindersSubtitle
source: Get notified when cards are due
pl: Otrzymuj powiadomienia, gdy karty są wymagalne

# settingsReviewSectionTitle
source: Review Settings
pl: Ustawienia powtórek

# settingsSelectLanguageTitle
source: Select {type} Language
pl: Wybierz język {type}

# settingsTargetLanguageTile
source: Target Language - Default
pl: Język docelowy – domyślny

# settingsVersionTile
source: Version
pl: Wersja

# signUpAppBarTitle
source: Sign Up
pl: Rejestracja

# signUpAuthError
source: Signup error
pl: Błąd rejestracji

# signUpButton
source: Sign Up
pl: Zarejestruj się

# signUpConfirmPasswordEmptyValidation
source: Please confirm your password
pl: Potwierdź hasło

# signUpConfirmPasswordLabel
source: Confirm Password
pl: Potwierdź hasło

# signUpCreateAccountHeadline
source: Create Account
pl: Utwórz konto

# signUpEmailEmptyValidation
source: Please enter your email
pl: Wprowadź adres e-mail

# signUpEmailInvalidValidation
source: Please enter a valid email
pl: Wprowadź poprawny adres e-mail

# signUpPasswordEmptyValidation
source: Please enter a password
pl: Wprowadź hasło

# signUpPasswordLabel
source: Password
pl: Hasło

# signUpPasswordLengthValidation
source: Password must be at least 6 characters
pl: Hasło musi mieć co najmniej 6 znaków

# signUpPasswordsDoNotMatchValidation
source: Passwords do not match
pl: Hasła nie są takie same

# signUpSuccessMessage
source: Account created! Please check your email to verify.
pl: Konto utworzone! Sprawdź swoją pocztę, aby zweryfikować.

# signUpUnexpectedError
source: An error occurred
pl: Wystąpił błąd

# stackDetailAddCardTooltip
source: Add flashcard to stack
pl: Dodaj fiszkę do stosu

# stackDetailEmptySubtitle
source: Add flashcards to start practicing
pl: Dodaj fiszki, aby rozpocząć ćwiczenie

# stackDetailEmptyTitle
source: No flashcards in this stack
pl: Brak fiszek w tym stosie

# stackDetailErrorLoading
source: Error loading flashcards
pl: Błąd wczytywania fiszek

# stackDetailRemoveCardTooltip
source: Remove flashcard from stack
pl: Usuń fiszkę ze stosu

# stackDetailStartPracticeTooltip
source: Start practice session
pl: Rozpocznij sesję ćwiczeń

# stackListAppBarTitle
source: Flashcard Stacks
pl: Stosy fiszek

# stackListApplicationLocaleChangeTitle
source: Change Application Language
pl: Zmień język aplikacji

# stackListApplicationLocaleDialogTitle
source: Change Application Language
pl: Zmień język aplikacji

# stackListCardSubtitle
source: {count,plural, =0{0 cards} =1{1 card} other{{count} cards}} â€¢ {description}
pl: {count,plural, =0{0 fiszek} =1{1 fiszka} other{{count} fiszek}} • {description}

# stackListCreateButton
source: CREATE
pl: UTWÓRZ

# stackListCreateDescHint
source: Enter stack description
pl: Wprowadź opis stosu

# stackListCreateDescLabel
source: Description
pl: Opis

# stackListCreateDialogTitle
source: Create New Stack
pl: Utwórz nowy stos

# stackListCreateFabTooltip
source: Create new stack
pl: Utwórz nowy stos

# stackListCreateNameHint
source: Enter stack name
pl: Wprowadź nazwę stosu

# stackListCreateNameLabel
source: Stack Name
pl: Nazwa stosu

# stackListEmptyButton
source: Create Stack
pl: Utwórz stos

# stackListEmptySubtitle
source: Create a stack to organize your flashcards
pl: Utwórz stos, aby zorganizować swoje fiszki

# stackListEmptyTitle
source: No stacks yet
pl: Brak stosów

# stackListErrorLoading
source: Error loading stacks
pl: Błąd wczytywania stosów
